# Projeto Final - Banco de Dados I  - Ada Tech
### Prof°: Rógerio Mainardes
### Aluno: Janderson Freitas

In [ ]:
#!pip install pandasql
#pip install sqlalchemy==1.4.46

In [1]:
import pandas as pd
import pandasql as ps
from sqlalchemy import create_engine
import os

## Cartão corporativo presidencial 2003 - 2022

#### Base de dados fonte da trabalho

## Conexão com Postgresql

In [7]:
SGBD = "postgresql+psycopg2"
USER = "postgres"
SENHA = "admin"
HOST = "localhost"
DATABASE = "Cartao_Corporativo"

engine = create_engine(f"{SGBD}://{USER}:{SENHA}@{HOST}/{DATABASE}")
conn = engine.connect()

In [56]:
query = "SELECT * FROM gastos_corporativos.gastos " 
gastos = pd.read_sql_query(query, con = conn)
gastos.head()

,id_compra,nome_fornecedor,tipo_compra,ano,valor,nome_presidente,mes,data_compra,valor_corrigido
0,0,JW TRANSPORTADORA TURÖSTICA,Débito,2003.0,1696.90,LULA,1,jan/03,5385.88500
1,1,JW TRANSPORTADORA TURÖSTICA,Débito,2003.0,1336.60,LULA,1,jan/03,4242.30860
2,2,JW TRANSPORTADORA TURÖSTICA,Débito,2003.0,1396.43,LULA,1,jan/03,4432.20650
3,3,FLORES ALVORADA,Crédito,2003.0,8585.00,LULA,1,jan/03,27248.40600
4,4,CRISTAL LIMPEZA - COMRCIO DE MATERIAIS PARA L...,Crédito,2003.0,251.50,LULA,1,jan/03,798.24976

In [66]:
gastos.shape

(113324, 9)

#### Análise Descritiva

 - Qual as tipagens das colunas?

In [19]:
gastos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 113324 entries, 0 to 113323
Data columns (total 9 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   id_compra        113324 non-null  int64
 1   nome_fornecedor  113324 non-null  object
 2   tipo_compra      113324 non-null  object
 3   ano              113324 non-null  float64
 4   valor            113324 non-null  float64
 5   nome_presidente  113324 non-null  object
 6   mes              113324 non-null  int64
 7   data_compra      113324 non-null  object
 8   valor_corrigido  113324 non-null  float64
dtypes: float64(3), int64(2), object(4)
memory usage: 7.8+ MB

#### Q1) Quantos nulos temos em cada coluna?

Os dados passaram por um tratamento prévio antes de virar .csv e serem carregados no postgres, com o objetivo do aluno ter uma melhor experiência focado nas querys SQL. 

- Fonte de dados: 'https://www.gov.br/secretariageral/pt-br/acesso-a-informacao/informacoes-classificadas-e-desclassificadas/Planilha12003a2022.csv'

- Link do notebook do processo de Extração e Transformação dos dados: 'https://github.com/JinzoFreitas/Analise-Cartao-Corporativo-presidencial/blob/main/cartao_corporativo.ipynb'

- Para os dados carregados do projeto, não temos nulos em nenhuma coluna.

#### Q2) Quantos valores únicos temos nas colunas categoricas?

In [43]:
query = '''

    SELECT
        nome_fornecedor,
        count(nome_fornecedor) as quantidade
    FROM gastos_corporativos.gastos
    GROUP BY nome_fornecedor
                
'''
pd.read_sql_query(query, con = conn)

                                       nome_fornecedor  quantidade
0                                       WINDSOR PALACE           1
1     CIA. INDUSTRIAL DE GRANDES HOTIS - HOTEL GLàRIA        1376
2                           SIQUEIRA SOARES LTDA - EPP           2
3                         CENTRAL SERVICE TURISMO LTDA           1
4                              V. ROMANELLI & CIA LTDA         140
...                                                ...         ...
8602      AP COM. DE ALIM. LTDA - TERM PASSA AEROPORTO           1
8603                               JACQUELINE Sµ SILVA           1
8604                         CENTRAL AGROPECUARIO LTDA           1
8605             MARLI DAL BERTO PASSAIA - RESTAURANTE           2
8606             ORION EMPREENDIMENTOS E ALUGUEIS LTDA           3

[8607 rows x 2 columns]

    - Colunas categóricas

    indx Colunas          Qt de valores únicos  
    ---  ---------------  ----- 
     0   nome_fornecedor  8607 
     1   tipo_compra      2 
     4   nome_presidente  4

#### questão 1) Qual o gasto total não corrigido de cada presidente?

In [10]:
query = ''' 

    SELECT
        nome_presidente,
        sum(valor) as gasto_total_absoluto
    FROM gastos_corporativos.gastos
    GROUP BY nome_presidente
    
'''
pd.read_sql_query(query, con = conn)

  nome_presidente  gasto_total_absoluto
0           TEMER             8869686.0
1           DILMA            34412964.0
2            LULA            43988240.0
3       BOLSONARO            27621530.0

#### questão 2) Qual o gasto total corrigido de cada presidente?

In [19]:
query = ''' 

    SELECT
        nome_presidente,
        sum(valor_corrigido) as gasto_total_corrigido
    FROM gastos_corporativos.gastos
    GROUP BY nome_presidente
    
'''
pd.read_sql_query(query, con = conn)

  nome_presidente  gasto_total_corrigido
0           TEMER             11650522.0
1           DILMA             57799488.0
2            LULA            109342376.0
3       BOLSONARO             31756092.0

*próximas peguntas todas referentes aos valores corrigidos pela inflação

#### questão 3) Qual a média total de gastos por mês usando o cartão presidencial?

In [27]:
query = '''

    SELECT
        (sum(valor_corrigido)/228) AS media_total_do_periodo
    FROM     
        gastos_corporativos.gastos    
'''
pd.read_sql_query(query, con = conn)

   media_total_do_periodo
0           923471.649123

#### Questão 4) Média de gatos das transações por presidente?

- LULA

In [42]:
query = '''
    
    SELECT
        AVG(valor_corrigido) AS media_por_transacoes
    FROM     
        gastos_corporativos.gastos
    WHERE nome_presidente = 'LULA'  

'''
pd.read_sql_query(query, con = conn)

   media_por_transacoes
0            1660.25128

- DILMA

In [41]:
query = '''
    
    SELECT
        AVG(valor_corrigido) AS media_por_transacoes
    FROM     
        gastos_corporativos.gastos
    WHERE nome_presidente = 'DILMA'  

'''
pd.read_sql_query(query, con = conn)

   media_por_transacoes
0           2189.039404

- TEMER

In [40]:
query = '''
    
    SELECT
        AVG(valor_corrigido) AS media__por_transacoes
    FROM     
        gastos_corporativos.gastos
    WHERE nome_presidente = 'TEMER'  

'''
pd.read_sql_query(query, con = conn)

   media__por_transacoes
0            1508.745428

- BOLSONARO

In [39]:
query = '''
    
    SELECT
        AVG(valor_corrigido) AS media_por_transacoes
    FROM     
        gastos_corporativos.gastos
    WHERE nome_presidente = 'BOLSONARO'  

'''
pd.read_sql_query(query, con = conn)

   media_por_transacoes
0           2380.695636

#### questão 5) Qual a soma de gastos totais do período?

In [85]:
query = '''

    SELECT
        sum(valor_corrigido) AS gasto_total_do_périodo
    FROM gastos_corporativos.gastos

'''
pd.read_sql_query(query, con = conn)

   gasto_total_do_périodo
0             210551540.0

#### questão 6) Quais as 3 empresa mais beneficiadas(valor) por presidente?

- LULA

In [53]:
query = '''

    SELECT
        nome_fornecedor,
        sum(valor_corrigido) as valor_total_por_empresa 
    FROM gastos_corporativos.gastos
    WHERE nome_presidente = 'LULA'
    GROUP BY nome_fornecedor
    ORDER BY valor_total_por_empresa DESC LIMIT 3
    
'''
pd.read_sql_query(query, con = conn)

                                     nome_fornecedor  valor_total_por_empresa
0              FULL TIME LOCAÇO E SERVIOS S/C LTDA                5721317.0
1  P.J.P. LOCAåES E SERVIOS LTDA - BRASÖLIA RENT A                3273567.0
2                            LOCALIZA RENT A CAR S/A                2872042.5

- DILMA

In [57]:
query = '''

    SELECT
        nome_fornecedor,
        sum(valor_corrigido) as valor_total_por_empresa 
    FROM gastos_corporativos.gastos
    WHERE nome_presidente = 'DILMA'
    GROUP BY nome_fornecedor
    ORDER BY valor_total_por_empresa DESC LIMIT 3
    
'''
pd.read_sql_query(query, con = conn)

                         nome_fornecedor  valor_total_por_empresa
0     GOLDEN TOWER HOTEIS E TURISMO LTDA                2366490.8
1  BOURBON IBIRAPUERA HOTEL & CONVENTION                2334436.0
2               MERCADINHO LA PALMA LTDA                2318399.0

- TEMER

In [58]:
query = '''

    SELECT
        nome_fornecedor,
        sum(valor_corrigido) as valor_total_por_empresa 
    FROM gastos_corporativos.gastos
    WHERE nome_presidente = 'TEMER'
    GROUP BY nome_fornecedor
    ORDER BY valor_total_por_empresa DESC LIMIT 3
    
'''
pd.read_sql_query(query, con = conn)

                      nome_fornecedor  valor_total_por_empresa
0            MERCADINHO LA PALMA LTDA                525230.40
1                BLUE TREE FARIA LIMA                511076.22
2  INTERNATIONAL MEAL COMPANY ALIMENT                506633.75

- BOLSONARO

In [59]:
query = '''

    SELECT
        nome_fornecedor,
        sum(valor_corrigido) as valor_total_por_empresa 
    FROM gastos_corporativos.gastos
    WHERE nome_presidente = 'BOLSONARO'
    GROUP BY nome_fornecedor
    ORDER BY valor_total_por_empresa DESC LIMIT 3
    
'''
pd.read_sql_query(query, con = conn)

                         nome_fornecedor  valor_total_por_empresa
0         HOTUR S PAULO PART E EMPR LTDA                1657280.5
1   COMPANHIA BRASILEIRA DE DISTRIBUIÇO                1319486.0
2  BIG TRANS COMERCIAL DE ALIMENTOS LTDA                 959098.2

#### questão 7) Quais as 5 empresas mais beneficiada(valor) de todos os tempos(2003-2022)?

In [61]:
query = '''

    SELECT
        nome_fornecedor,
        sum(valor_corrigido) AS valor_total_por_empresa 
    FROM gastos_corporativos.gastos
    GROUP BY nome_fornecedor
    ORDER BY valor_total_por_empresa DESC LIMIT 5

'''
pd.read_sql_query(query, con = conn)

                                     nome_fornecedor  valor_total_por_empresa
0                           MERCADINHO LA PALMA LTDA                6351730.5
1              FULL TIME LOCAÇO E SERVIOS S/C LTDA                5721317.0
2               COMPANHIA BRASILEIRA DE DISTRIBUIÇO                4558713.0
3              BOURBON IBIRAPUERA HOTEL & CONVENTION                4407380.0
4  P.J.P. LOCAåES E SERVIOS LTDA - BRASÖLIA RENT A                3273567.0

#### questão 8) Quais as 5 empresa com maior numero de transações em todo período?

In [48]:
query = '''

    SELECT
        nome_fornecedor,
        count(nome_fornecedor) as quantidade
    FROM gastos_corporativos.gastos
    GROUP BY nome_fornecedor
    ORDER BY quantidade DESC LIMIT 5

'''
pd.read_sql_query(query, con = conn)

                         nome_fornecedor  quantidade
0   COMPANHIA BRASILEIRA DE DISTRIBUIÇO        4710
1               MERCADINHO LA PALMA LTDA        3591
2                 ABACO SCP SAINT MORITZ        2793
3  BOURBON IBIRAPUERA HOTEL & CONVENTION        2617
4  BIG TRANS COMERCIAL DE ALIMENTOS LTDA        2170

#### Questão 9) Quais as 5 empresas com maior média de valor por transações?

In [62]:
query = '''
    
    SELECT
        nome_fornecedor,
        (sum(valor_corrigido)/count(nome_fornecedor)) AS media_por_trasacao 
    FROM gastos_corporativos.gastos
    GROUP BY nome_fornecedor
    ORDER BY media_por_trasacao DESC LIMIT 5

'''
pd.read_sql_query(query, con = conn)

                         nome_fornecedor  media_por_trasacao
0  SHOWïS ESTRUTURAS E EVENTOS LTDA - ME       278313.312500
1         HOTUR S PAULO PART E EMPR LTDA       165728.050000
2                  CASA GRANDE HOTEL S/A       140093.125000
3         LSG SKY CHEFS PHILADELPHIA, PA       107106.937500
4                          HOTEL ZIBAMBA       105071.445312

#### Questão 10) Qual a percentual entre os tipos de compras do cartão presidencial?

In [79]:
query = '''
    
    SELECT
        tipo_compra,
        count(tipo_compra) AS Quantidade_transacoes
    FROM gastos_corporativos.gastos
    GROUP BY tipo_compra
    ORDER BY Quantidade_transacoes DESC
    
'''
resp_10 = pd.read_sql_query(query, con = conn)
resp_10

  tipo_compra  quantidade_transacoes
0     Crédito                  91213
1      Débito                  22111

In [80]:
total = sum(resp_10['quantidade_transacoes'])
credito, debito = resp_10['quantidade_transacoes'][:]

perc_cred = (credito/total)*100
perc_debt = (debito/total)*100

In [81]:
print(f'Crédito: {perc_cred:.2f}%')
print(f'Débito: {perc_debt:.2f}%')

Crédito: 80.49%
Débito: 19.51%